tests/loadtesting/csr-http-load-test-appointments.yaml
config:
  # Can toggle below
  target: "http://localhost:5000"
  # target: "https://dev-theq.pathfinder.gov.bc.ca"
  http:
    maxSockets: 3


  phases:
    # - duration: 3
    #   arrivalRate: 1
    #   name: Warm up
    - duration: 3
      arrivalRate: 1
      name: Ramp up load
  variables:
  processor: "./functions.js"

scenarios:
  - name: "(HTTP) CSR – Authenticated api route"
    beforeRequest: 'setAuthHeader'
    weight: 75
    flow:
      - get:
          url: "/api/v1/citizens/"
      - get:
          url: "/api/v1/appointments/"
      - get:
          url: "/api/v1/categories/"
      - get:
          url: "/api/v1/channels/"
      - get:
          url: "/api/v1/services/?office_id=1"
      - log: "exam_types running"
      - get:
          url: "/api/v1/exam_types/"
      - log: "post appointments appointment running"
      - post:
          # url: "/api/v1/appointments/draft"
          url: "/api/v1/appointments/"
          json:
            start_time: "2020-11-05T17:45:00Z"
            end_time: "2020-11-05T18:00:00Z"
            service_id: 21
            citizen_name: "name from test"
            contact_information: ""
            office_id: 7
            appointment_draft_id: 1
          capture:
            json: "$.appointment.appointment_id"
            as: "appointment_id"
          strict: false # We don't mind if id can't be captured and the next requests 404s
      - log: "updating appointment {{appointment_id}} running"
      - put:
          url: "/api/v1/appointments/{{appointment_id}}/"
          json:
            start_time: "2020-11-05T17:45:00Z"
            end_time: "2020-11-05T18:00:00Z"
            service_id: 21
            citizen_name: "updated name from test"
            contact_information: ""
            office_id: 7
            appointment_draft_id: 1
          capture:
            json: "$.appointment.appointment_id"
            as: "updateappointment_id"
          strict: false # We don't mind if id can't be captured and the next requests 404s
      - log: "delet appointment {{updateappointment_id}} running"
      - delete:
          url: "/api/v1/appointments/{{appointment_id}}/"
      #     capture:
      #       json: "$.appointmentid"
      #       as: "appointment"
      #     strict: false # We don't mind if id can't be captured and the next requests 404s
      # - log: "delet  draft appointment {{appointment}} running"
      # - delete:
      #   url: "/api/v1/appointments/draft/{{appointment}}"


# TODO - Add SocketIO tests --  
# engine: "socketio"